/*
বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

সোনালী আভায়
সাথে ফিরি আমি মেঘে মেঘান্তরে
হিমেল বাতাসে ডানা মেলি আমি
দূরে দূরান্তরে

বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

পাখীরা সব মেতেছে আজ কুঞ্জবনে
মাতাল করেছে এই মন
গানে গানে নিবিড়ে আজ
কেটে যায় এ’ক্ষন
প্রজাপতি হয়ে ফিরবো ফুলে ফুলে
তবু কেন এত ব্যথা
জাগে মনে অশ্রুধারা
হৃদয়…

বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

পাখীরা সব মেতেছে আজ কুঞ্জবনে
মাতাল করেছে এই মন
গানে গানে নিবিড়ে আজ
কেটে যায় এ’ক্ষন
প্রজাপতি হয়ে ফিরবো ফুলে ফুলে
তবু কেন এত ব্যথা
জাগে মনে অশ্রুধারা
হৃদয়…

বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

সোনালী আভায়
সাথে ফিরি আমি মেঘে মেঘান্তরে
হিমেল বাতাসে ডানা মেলি
আমি দূরে দূরান্তরে

সোনালী আভায়
সাথে ফিরি আমি মেঘে মেঘান্তরে
হিমেল বাতাসে ডানা মেলি আমি
দূরে দূরান্তরে

#pragma GCC optimize("Ofast")
#pragma GCC target("avx,avx2,fma")
#pragma GCC optimization("unroll-loops")
*/
#include <bits/stdc++.h>
//#define ll              long long

#define vi              vector<int>
#define pb              push_back
//#define mp              make_pair

//#define ff              first
//#define ss              second

#define fast_in_out     ios_base::sync_with_stdio(false);cin.tie(0);
using namespace std;
int main()
{
    fast_in_out
    //freopen ("myfile.txt","w",stdout);
    vi ans;
    int n,v,t,sum,x;
    cin>>n>>v;
    for(int i=1;i<=n;i++){
        sum=0;
        cin>>t;
        while(t--){
            cin>>x;
            if(v>x)sum++;
        }
        if(sum>0)ans.pb(i);
    }
    cout<<(int)(ans.size())<<'\n';
    if(!ans.empty()){
        for(auto it=ans.begin();it!=ans.end();it++)cout<<*it<<" ";
    }
    cout<<'\n';
    return 0;
}
