/*শুধু সে ভুল ভাবনায়
যেতে চাইলে যাও চলে যাও
তবু কেনো এ কান্না?
জানি ভালো থাকতে
শুধু বলোনা ভুলতে
চাইনা বাঁচার উপদেশ
দিন এমনই কাটবে
খেয়ালের ফাঁদে

তোমাকে মনে পরবে
যখনই জোছনা হাসে
তোমাকে মনে পরবে
যখনই আকাশ ভেঙে বর্ষা কাঁদে

যেই মোহের বন্যায়
ভেসে যাওয়া ধন্য হলে
তাতে পারিনি ভাসতে
অস্তিত্ব ভুলে, ভুলে

তাই বলোনা চলতে
স্থবিরতাই সঙ্গী হলে
মন পোড়াই থাকলে
হতাশার ফাঁদে

তোমাকে মনে পরবে
যখনই জোছনা হাসে
তোমাকে মনে পরবে
যখনই আকাশ ভেঙে বর্ষা কাঁদে

যে যায় যাওয়ার পথে দেয়াল হবার কোন স্বপ্ন নাই
যতই কাঁদাও আমায়
চলি একা পথে

তোমাকে মনে পরবে
যখনই জোছনা হাসে
তোমাকে মনে পরবে
যখনই আকাশ ভেঙে বর্ষা কাঁদে

তোমাকে মনে পরবে
যখনই জোছনা হাসে
তোমাকে মনে পড়বে
যখনই বর্ষা কাদে

তোমাকে মনে পরবে
যখনই জোছনা হাসে
তোমাকে মনে পরবে
যখনই আকাশ ভেঙে বর্ষা কাঁদে
*/
#include <bits/stdc++.h>
#define fast_in_out     ios_base::sync_with_stdio(false);cin.tie(0);
using namespace std;
int main()
{
    fast_in_out
    //freopen ("myfile.txt","w",stdout);
    //int t;cin>>t;
    int n,k,f,t,maxim=-1000000009;
    cin>>n>>k;
    for(int i=1;i<=n;i++){
        cin>>f>>t;
        if(t>k)f-=(t-k);
        if(f>maxim)maxim=f;
    }
    cout<<maxim<<'\n';
    return 0;
}
