/*
বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

সোনালী আভায়
সাথে ফিরি আমি মেঘে মেঘান্তরে
হিমেল বাতাসে ডানা মেলি আমি
দূরে দূরান্তরে

বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

পাখীরা সব মেতেছে আজ কুঞ্জবনে
মাতাল করেছে এই মন
গানে গানে নিবিড়ে আজ
কেটে যায় এ’ক্ষন
প্রজাপতি হয়ে ফিরবো ফুলে ফুলে
তবু কেন এত ব্যথা
জাগে মনে অশ্রুধারা
হৃদয়…

বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

পাখীরা সব মেতেছে আজ কুঞ্জবনে
মাতাল করেছে এই মন
গানে গানে নিবিড়ে আজ
কেটে যায় এ’ক্ষন
প্রজাপতি হয়ে ফিরবো ফুলে ফুলে
তবু কেন এত ব্যথা
জাগে মনে অশ্রুধারা
হৃদয়…

বসে আছি একা
কাঁচা রোদ বিকেলে উদাস
বৃষ্টি শেষে রূপালী আকাশ
মেঘে জানালাতে
ঝিলমিল সোনালী আভায়
ঝিরঝির বয় হিমেল বাতাস

সোনালী আভায়
সাথে ফিরি আমি মেঘে মেঘান্তরে
হিমেল বাতাসে ডানা মেলি
আমি দূরে দূরান্তরে

সোনালী আভায়
সাথে ফিরি আমি মেঘে মেঘান্তরে
হিমেল বাতাসে ডানা মেলি আমি
দূরে দূরান্তরে
*/
#include <bits/stdc++.h>
#pragma GCC optimize("Ofast")
#pragma GCC target("avx,avx2,fma")
#pragma GCC optimization("unroll-loops")
using namespace std;
#define fast_in_out     ios_base::sync_with_stdio(false);cin.tie(0);
char ch[125][125];
int main()
{
    fast_in_out
    string s;
    int t,sum;
    cin>>t;
    cin.ignore();
    for(int j=1;j<=t;j++){
        for(int i=1;i<=t;i++)cin>>ch[j][i];
    }
    for(int i=1;i<=t;i++)
        for(int j=1;j<=t;j++)
        {
            sum=(ch[i-1][j]=='o')+(ch[i+1][j]=='o')+(ch[i][j+1]=='o')+(ch[i][j-1]=='o');
            if(sum%2){
                cout<<"NO\n";
                return 0;
            }

        }
    cout<<"YES\n";
    return 0;
}
